; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v3 - type_3 ?v4 - type_1)
 	      (pred_1 ?v1 - object ?v4 - type_1)
	      (pred_4 ?v3 - type_3 ?v6 - type_2)
	      (pred_2 ?v3 - type_3 ?v1 - object ?v6 - type_2))

   (:action op_3
       :parameters  (?v3 - type_3 ?v2 ?v5 - type_1)
       :precondition (and  (pred_3 ?v3 ?v2))
       :effect (and  (pred_3 ?v3 ?v5)
		     (not (pred_3 ?v3 ?v2))))

   (:action op_2
       :parameters (?v3 - type_3 ?v7 - object ?v8 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v8) (pred_3 ?v3 ?v8) (pred_4 ?v3 ?v6))
       :effect (and (pred_2 ?v3 ?v7 ?v6)
		    (not (pred_1 ?v7 ?v8)) 
		    (not (pred_4 ?v3 ?v6))))

   (:action op_1
       :parameters (?v3 - type_3 ?v7 - object ?v8 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v7 ?v6) (pred_3 ?v3 ?v8))
       :effect (and (pred_1 ?v7 ?v8)
		    (pred_4 ?v3 ?v6)
		    (not (pred_2 ?v3 ?v7 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_02 - type_3
obj_09 obj_08 - type_2
obj_07 obj_05 obj_04 obj_10 - type_1
obj_03 obj_01 obj_06 - object)
(:init
(pred_3 obj_02 obj_10)
(pred_4 obj_02 obj_09)
(pred_4 obj_02 obj_08)
(pred_1 obj_03 obj_10)
(pred_1 obj_01 obj_05)
(pred_1 obj_06 obj_10)
)
(:goal
(and
(pred_1 obj_03 obj_07)
(pred_1 obj_01 obj_07)
(pred_1 obj_06 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_02 ?b obj_08))))
)
)

; plan
1. (op_2 obj_02 obj_03 obj_10 obj_09)
   deleted: (pred_1 obj_03 obj_10) (pred_4 obj_02 obj_09)
   added: (pred_2 obj_02 obj_03 obj_09)
   goals met: 0 of 3
2. (op_3 obj_02 obj_10 obj_07)
   deleted: (pred_3 obj_02 obj_10)
   added: (pred_3 obj_02 obj_07)
   goals met: 0 of 3
3. (op_1 obj_02 obj_03 obj_07 obj_09)
   deleted: (pred_2 obj_02 obj_03 obj_09)
   added: (pred_1 obj_03 obj_07) (pred_4 obj_02 obj_09)
   goals met: 1 of 3
4. (op_3 obj_02 obj_07 obj_05)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_05)
   goals met: 1 of 3
5. (op_2 obj_02 obj_01 obj_05 obj_09)
   deleted: (pred_1 obj_01 obj_05) (pred_4 obj_02 obj_09)
   added: (pred_2 obj_02 obj_01 obj_09)
   goals met: 1 of 3
6. (op_3 obj_02 obj_05 obj_07)
   deleted: (pred_3 obj_02 obj_05)
   added: (pred_3 obj_02 obj_07)
   goals met: 1 of 3
7. (op_1 obj_02 obj_01 obj_07 obj_09)
   deleted: (pred_2 obj_02 obj_01 obj_09)
   added: (pred_1 obj_01 obj_07) (pred_4 obj_02 obj_09)
   goals met: 2 of 3
8. (op_3 obj_02 obj_07 obj_10)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_10)
   goals met: 2 of 3
9. (op_2 obj_02 obj_06 obj_10 obj_09)
   deleted: (pred_1 obj_06 obj_10) (pred_4 obj_02 obj_09)
   added: (pred_2 obj_02 obj_06 obj_09)
   goals met: 2 of 3
10. (op_3 obj_02 obj_10 obj_07)
   deleted: (pred_3 obj_02 obj_10)
   added: (pred_3 obj_02 obj_07)
   goals met: 2 of 3
11. (op_1 obj_02 obj_06 obj_07 obj_09)
   deleted: (pred_2 obj_02 obj_06 obj_09)
   added: (pred_1 obj_06 obj_07) (pred_4 obj_02 obj_09)
   goals met: 3 of 3
